package com.welldo.scalaStudy.chapter3.Bitwise5

/**
  * Scala 中的按位运算法则如下：
  *
  * &	按位与运算符	(a & b) 输出结果 12 ，二进制解释： 0000 1100
  * |	按位或运算符	(a | b) 输出结果 61 ，二进制解释： 0011 1101
  * ^	按位异或运算符	(a ^ b) 输出结果 49 ，二进制解释： 0011 0001
  * ~	按位取反运算符	(~a ) 输出结果 -61 ，二进制解释： 1100 0011， 在一个有符号二进制数的补码形式。
  * <<	左移动运算符	a << 2 输出结果 240 ，二进制解释： 1111 0000
  * >>	右移动运算符	a >> 2 输出结果 15 ，二进制解释： 0000 1111
  * >>>	无符号右移	A >>>2 输出结果 15, 二进制解释: 0000 1111
  *
  *
  * author: welldo 
  * date: 2019/11/26 15:48
  */
object Demo {

}
